Revit 2027 API
BuiltInFailures.GridChainSketchFailures.ClosedLoop Property
 GridChain sketch contains a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ClosedLoop { get; }
Public Shared ReadOnly Property ClosedLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ClosedLoop {
	FailureDefinitionId^ get ();
}
static member ClosedLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridChainSketchFailures Class
Autodesk.Revit.DB Namespace